{
  "id": "00_04_the_pied_piper",
  "act": 0,
  "sceneNumber": 4,
  "title": "The Pied Piper",
  "centralQuestion": "How will the players neutralize Wally and his magical flute?",
  "recommendedTime": "30-40 minutes",
  "situationAspects": [
    "Flimsy Shack",
    "Boxes of 'Magic' Supplies",
    "Deafening, Discordant Music"
  ],
  "readAloud": {
    "opening": "Up close, Wally's shack is even more pathetic than it looked from a distance. The walls lean at impossible angles, held together by hope, duct tape, and what might be sheer theatrical stubbornness. Faded posters peel from the exterior—\"WALLY'S WANDERING WONDERS! MAGIC! MYSTERY! MIRTH!\"—alongside crude illustrations of rabbits in hats and doves in flight.",
    "perspective": "The whole structure smells of mildew, sawdust, and something chemical and acrid, like the air after fireworks. Your nose burns from the assault of scents: old sweat, rotting fabric, metal polish, gunpowder residue from stage tricks, and underneath it all, the sharp ozone smell of active magic. It's nauseating.\n\nThe music is *deafening* now. Not just loud—it's *painful*. The flute hits frequencies that cats aren't meant to hear, piercing notes that make your skull feel like it's splitting. Your ears flatten against your head reflexively, but it doesn't help. The sound penetrates everything.\n\nThrough the gaps in the walls, you can see him. Wally is... not what you expected. He's a small human—for a human—rail-thin, with wild hair that might have once been styled but now sticks up in greasy spikes. His coat is threadbare velvet, once deep purple but now faded to the color of old bruises. He's standing in the center of the shack, eyes closed in what looks like ecstasy, swaying as he plays. The flute in his hands gleams with an unnatural silver light that *hurts to look at*."
  },
  "npcs": [
    {
      "id": "wally_the_pied_piper",
      "name": "Wally, the Pied Piper",
      "pronouns": "he/him",
      "role": "Delighted by the chaos he is creating",
      "aspects": {
        "highConcept": "Failed Stage Magician with Real Magic",
        "trouble": "Desperate for Validation"
      }
    }
  ],
  "zones": [],
  "potentialOutcomes": [
    {
      "type": "success",
      "description": "The players manage to disarm Wally, either by taking the flute, breaking it, or otherwise silencing its magic. The animals slowly begin to come to their senses, and Wally flees in the confusion."
    },
    {
      "type": "successWithCost",
      "description": "They stop the music, but not before Wally uses the chaos to create a significant complication, like starting a fire in the shack or causing a stampede in a dangerous direction."
    },
    {
      "type": "failure",
      "description": "Wally escapes with his flute intact, leaving the players to deal with a massive, confused, and now very angry mob of wild and domestic animals."
    }
  ],
  "gmGuidance": {
    "leversAndButtons": [
      "Disarm the Music: Overcome with Fight/Athletics/Deceive to separate Wally from the flute or block airflow (cloth, water, jam the mouthpiece).",
      "Drown the Sound: Create Advantage with Crafts/Lore to set up counter-noise, insulation, or disrupt acoustics (topple shelves, thick curtains, foam).",
      "Turn the Crowd: Create Advantage with Rapport/Provoke to rally calmer animals to form a living barrier.",
      "Trap the Piper: Overcome with Crafts/Notice to rig nets/cords; free invoke on \"Tangled in Props\"."
    ],
    "hiddenAspects": [
      "Cracked Reagent Vial (Investigate): Alchemical residue that amplifies sound; smashing it weakens the flute.",
      "False Bottom in Trunk (Notice/Crafts): Holds show notes mapping performances to recent incidents (breadcrumb to orchestrated chaos, Act 2 links).",
      "Back Exit to Alley (Notice): Route for chase or ambush."
    ],
    "breadcrumbs": [
      "Stage notes mention a \"zoo gig\" with a contact named \"R\" (points to Ra).",
      "Receipt from a hardware store for specialized wrench (ties to hydrant scene)."
    ],
    "failForward": [
      "Wally escapes but drops the flute's reed or silver inlay (usable as anti-shifter clue later).",
      "The shack catches fire creating a scene aspect **Smoke and Sparks**, complicating retreat but revealing the hidden trunk."
    ],
    "compels": []
  },
  "asSceneUnfolds": [
    {
      "trigger": "If players investigate the half-open trunk (Notice/Investigate)",
      "description": "Peering into the trunk while staying low, you spot several interesting items: A cracked glass vial, still leaking a thin, oily substance that smells sharp and chemical. The label reads \"Stage Voice Amplifier—Alchemical Solution.\" There are droplets on the flute's mouthpiece. Whatever this stuff is, it's enhancing the magic. Beneath it, a rolled-up sheaf of papers—show notes. One page is marked \"UPCOMING GIGS\" with several entries scratched out. But one remains, circled multiple times in red: \"ZOO CHARITY EVENT - CONTACT: R. - PAYMENT: $500 + SPECIAL PROP.\" There's a crude drawing in the margin: a silver tag on a chain. There's also a hardware store receipt for \"specialty wrench set (imported)\" with a delivery address in town."
    },
    {
      "trigger": "If players examine the back exit (Notice/Stealth)",
      "description": "The curtain concealing the back door is tattered purple velvet. Behind it, the door is held shut by a single rusty latch—easy to open from this side. Beyond, you can see darkness, trees, and what looks like a narrow animal path. More importantly, there are muddy prints on the floor near the door—boot prints (Wally's presumably) and something else. Paw prints. Feline, but oddly perfect, like the ones you might have seen at the clearing's edge. They overlap Wally's tracks, suggesting someone else was here recently, someone who came and went and left no trace outside."
    },
    {
      "trigger": "If players try to disrupt Wally without direct confrontation (Create Advantage with environment)",
      "description": "The flash paper catches your eye. It's stored in a metal tin, sitting dangerously close to an old oil lamp that's somehow still lit. If you could knock that lamp over—carefully—the flash would be spectacular: a burst of light and sound, completely harmless but shocking. Wally might drop the flute in surprise. Alternatively, the shack's support beam nearest you is cracked and looks like it's held together mostly by prayer. A good solid hit could cause a partial collapse. Or there's the fog machine—old, battery-powered, probably doesn't work anymore, but it might have a little juice left."
    },
    {
      "trigger": "If players confront Wally directly (social or physical conflict)",
      "description": "If you call out to Wally, try to reason with him, or simply attack, he *will* notice you. His eyes snap open, focusing with manic intensity. \"Cats!\" he shrieks, voice high and cracking. \"You're not part of the show! You're supposed to be in the AUDIENCE! Get back, get back!\" He swings the flute like a weapon, and the music becomes discordant, aggressive. If you can match his energy—out-crazy the crazy, perhaps, or appeal to his damaged ego (\"You're better than this trick! A REAL magician wouldn't need to enslave his audience!\")—he might falter. His greatest desire is recognition, validation. His greatest fear is being called a hack. But if the fight goes badly, he'll absolutely try to turn the flute on you directly."
    }
  ],
  "completed": false
}
