{
  "id": "00_03_the_lynx_guide",
  "act": 0,
  "sceneNumber": 3,
  "title": "The Lynx Guide",
  "centralQuestion": "Can the players navigate the chaotic horde of mesmerized animals to reach Wally's shack?",
  "recommendedTime": "25-35 minutes",
  "situationAspects": [
    "A Terrifying, Trampling Menagerie",
    "Cats are Prey Here",
    "The Flute's Song is Overpowering"
  ],
  "readAloud": {
    "opening": "The deeper you push into the Darkwoods, the stranger things become. The ancient silence of the forest gives way to something far more unsettling: sound. Not the natural chorus of night birds and rustling leaves, but a discordant symphony—the thunder of hooves, the crash of bodies through undergrowth, the bleating, braying, howling cacophony of dozens of animals moving as one. And beneath it all, threading through the chaos like a silver needle, you hear it: music. A flute, playing a melody that shouldn't exist, notes that slip and slide and refuse to resolve into anything recognizable.",
    "perspective": "Jewels moves beside you, low and tense, every muscle coiled. \"This is wrong,\" the young lynx whispers. \"Animals don't move like this. They don't *sound* like this.\"\n\nAs you crest a small ridge, the scene below stops you cold.\n\nThe forest opens into a natural clearing—or what used to be one. Now it's a churning mass of bodies, a living river of flesh and fur flowing in rough circles around a ramshackle structure at the clearing's far edge. Deer, raccoons, foxes, dogs—both wild and domestic—even a few confused house cats stumbling along in the current. They move with vacant eyes, their gazes fixed on something unseen, their movements jerky and uncoordinated yet somehow synchronized to the maddening pulse of the flute music.\n\nThe structure they circle is barely worthy of the name \"shack.\" It's a lean-to of mismatched boards, corrugated metal, and what looks like repurposed carnival canvas, all lashed together with fraying rope and desperate hope. Garish paint peels from the walls—faded stars and moons, the remnants of \"WALLY'S WANDERING WONDERS\" barely visible."
  },
  "npcs": [
    {
      "id": "animal_horde",
      "name": "The Animal Horde",
      "pronouns": "they/them",
      "role": "A dangerous, moving obstacle course of creatures large and small",
      "aspects": {
        "highConcept": "Mesmerized Menagerie"
      }
    }
  ],
  "zones": [],
  "potentialOutcomes": [
    {
      "type": "success",
      "description": "The players cleverly use the environment and their skills to navigate the horde and reach the shack unscathed."
    },
    {
      "type": "successWithCost",
      "description": "The players make it to the shack, but one of them (or their allies, Sappho and Jewels) takes a minor consequence from a panicked animal's kick or bite."
    },
    {
      "type": "failure",
      "description": "A significant portion of the group is separated or bogged down by the horde, forcing a rescue or a change of plans before they can approach the shack."
    }
  ],
  "gmGuidance": {
    "leversAndButtons": [
      "Pathfind Through Chaos: Create Advantage with Athletics/Notice to identify safe lanes; free invoke on \"Open Channel\" grants zone shifts.",
      "Crowd Control: Overcome with Rapport/Provoke/Animal Handling-equivalent to redirect smaller clusters.",
      "Environmental Use: Create Advantage with Crafts/Lore to topple barriers, spill grain, or trigger sprinklers to break line of movement.",
      "High Ground: Overcome with Athletics to reach rooftops/trees; gain scene aspect **Above the Herd**."
    ],
    "hiddenAspects": [
      "Weak Link in the Flow (Investigate): A gap between large animals cycles every few beats.",
      "Flute Echo on the Wind (Notice/Lore): Directional cue toward Wally's shack.",
      "Predator Scent Trail (Notice): Non-local feline odor hints at a shapeshifter's passage."
    ],
    "breadcrumbs": [
      "Scratches on posts align like tally marks (someone practicing cadence—points to Wally's routine).",
      "A scrap of stage glitter on a fence (links to Scene 4's props)."
    ],
    "failForward": [
      "Separated PC gains a boost \"Eyes on the Prize\" from unique vantage, but takes a mild consequence.",
      "Lose time but discover a safer alternate route granting a future free invoke."
    ],
    "compels": []
  },
  "asSceneUnfolds": [
    {
      "trigger": "If players study the horde's movement (Notice/Investigate)",
      "description": "Watching carefully, you start to see the pattern. The horde moves in rough concentric circles, but there are eddies, breaks in the flow where animals stumble or change direction. Every forty-five seconds or so, a gap opens near the fallen log on the clearing's western edge—big enough for a cat-sized creature to slip through if they're fast and brave. The gap stays open for maybe five seconds before a lumbering mastiff closes it again. There's also a high-traffic zone directly in front of the shack's door where the animals seem to compress, jostling and pushing. It's the most dangerous spot, but also where the music's hold seems strongest."
    },
    {
      "trigger": "If players examine the environment for tools (Notice/Crafts)",
      "description": "The old picnic table is partially collapsed, but there's a plank of wood still attached by rusted nails. With some work, you could pry it free and use it as a ramp or bridge between the tree stumps, creating an elevated path across part of the clearing. Near the shack's side, you spot a rain barrel—wooden, heavy, half-full of stagnant water. If you could tip it or knock it over, the noise and sudden obstacle might scatter a section of the horde. There are also scattered props from Wally's previous performances: a juggling pin, a torn top hat, a small brass bell."
    },
    {
      "trigger": "If players attempt to resist the music's pull (Will/Lore)",
      "description": "The melody is insidious. It doesn't attack your mind directly; instead, it offers comfort. *Why struggle? Why think so hard? Just relax. Just follow.* You feel your muscles wanting to move in time with the circling horde, your thoughts beginning to blur at the edges. But you're not helpless. Focusing on something concrete—a vivid memory, a loved one's face, even pain (dig your claws into your paw pad)—helps anchor you. The longer you stay here, the harder it will be to resist. The flute itself is likely the focus. Destroy it, silence it, or even just knock it from Wally's hands, and the spell should break."
    },
    {
      "trigger": "If players look for evidence of who's behind this (Notice/Investigate)",
      "description": "Near the tree line, almost hidden in the shadows, you spot something odd: paw prints pressed into soft earth. Feline, but wrong somehow. Too perfect, like a stamp rather than a living creature's track. They lead to the clearing's edge and then... stop. Mid-stride. As if whoever made them simply vanished. On one of the fence posts near the shack, there's a scrap of fabric—glossy, theatrical, like stage curtain material. It's caught on a splinter and flutters in the breeze. There's a faint scent clinging to it, musky and unfamiliar. Not human, not dog, not cat. Something *other*."
    }
  ],
  "completed": false
}
