{
  "id": "03_01_pound_rescue",
  "act": 3,
  "sceneNumber": 1,
  "title": "The Pound Rescue",
  "centralQuestion": "How will the players break Sappho out of the Animal Control pound?",
  "recommendedTime": "35-45 minutes",
  "situationAspects": [
    "Cold, Sterile Cages",
    "Humans in Uniform",
    "The Howling of the Damned (constant, terrified animal sounds)",
    "Everything Smells of Bleach and Fear",
    "Nowhere to Hide (bright lights, hard surfaces, open spaces)",
    "The Wrong Cat Scent (faint but present)"
  ],
  "readAloud": {
    "opening": "The Animal Control building looms before you, all concrete and chain-link fence.",
    "perspective": "The smell hits you first, even from outside: disinfectant so strong it burns your nose, mixed with fear-sweat from dozens of trapped animals, urine, bleach, and underneath it all, despair. It's a place where animals go and sometimes don't come back. Every instinct screams at you to run.\n\nAs you slip inside through a vent, the sounds assault you. Dogs barking, howling, whimpering—some in rage, some in terror, some just calling hopelessly for their humans. Cats yowling. The mechanical hum of fluorescent lights buzzing at a frequency that makes your teeth ache. Metal doors clanging. Human voices, loud and echoing off tile walls.\n\nThe floor is cold linoleum under your paws, slick and chemical-smelling. Everything is hard surfaces—no soft places, no warmth. The lights are too bright, washing out shadows, leaving nowhere to hide. The cages are arranged in rows, each one a metal box with bars. You can see Sappho in one, her normally proud posture diminished, looking smaller in the harsh light.\n\nThe air is wrong here. Recycled, stale, too cold. And beneath everything, you catch that scent again: cat, but *wrong*. Someone else has been here. Recently."
  },
  "npcs": [
    {
      "id": "sappho",
      "name": "Sappho",
      "pronouns": "she/her",
      "role": "Trapped, scared, but defiant",
      "aspects": {
        "highConcept": "Swashbuckling Sea Dog Captain",
        "trouble": "Heart Before Head"
      },
      "linguisticClues": "You came! They were not cats... they wore faces of friends... (in Dog-Conlang)"
    },
    {
      "id": "animal_control_officers",
      "name": "Animal Control Officers",
      "pronouns": "they/them",
      "role": "Professional, but not expecting a coordinated jailbreak from cats",
      "aspects": {
        "highConcept": "Well-Meaning but Overworked"
      }
    }
  ],
  "zones": [],
  "potentialOutcomes": [
    {
      "type": "success",
      "description": "A stealthy infiltration, a loud distraction, or a full-on assault. Success means Sappho is freed, and the players recover **another shell fragment of the Speaking Stone** she was guarding. She had hidden it in her collar when the shapeshifters ambushed them. If they attempted the optional objective, they may also escape with the silver tag."
    },
    {
      "type": "failure",
      "description": "The rescue fails, and the players are forced to retreat. Failure during the optional objective will almost certainly alert all the Animal Control Officers, putting the main rescue in jeopardy."
    }
  ],
  "gmGuidance": {
    "leversAndButtons": [
      "Infiltration Routes: Create Advantage with Stealth/Crafts to map vents, roof hatches, and kennel keys; add \"Quiet Path\" and \"Borrowed Keyring\" with free invokes.",
      "Distraction Play: Provoke/Rapport to trigger a kennel chorus or staged commotion; boost \"All Eyes on Aisle 3\".",
      "Human Systems: Lore/Investigate to manipulate door magnets, motion sensors, and logs; place \"Timed Unlocks\".",
      "Dog Solidarity: Rapport/Empathy to coordinate with friendly dogs for a coordinated howl or cage bump chain that shifts zones."
    ],
    "hiddenAspects": [
      "Rotating Patrol Pattern (Notice): A predictable gap every few minutes.",
      "Silver Tag Location (Investigate): On a hookboard in the office; discover via clipboard inventory or reflected glint.",
      "Scent of a Cat (Notice): Minute traces in staff area; foreshadows a prior shifter visit."
    ],
    "breadcrumbs": [
      "Intake notes reference animals from the zoo, cross-listing enclosure numbers.",
      "A misplaced requisition form for silver tags stamped with a vendor used by the zoo contractor."
    ],
    "failForward": [
      "Alarm trips, but PCs still free Sappho; they escape with a consequence and a pursuit clock.",
      "They miss the tag but learn the vendor and get a map to the office for a later return."
    ],
    "compels": [
      "PC loyalty to free other dogs, stretching time and risking exposure.",
      "Sappho's pride to attempt a bold escape move that changes the plan mid-run."
    ]
  },
  "asSceneUnfolds": [],
  "completed": false,
  "gmNotes": "This scene is the ideal place for Mystic Mogg to be separated from the group and replaced by Ra. Mogg might volunteer for a solo diversion or get cut off during the escape. When \"Mogg\" rejoins the party, it is secretly Ra in disguise.\n\nOPTIONAL OBJECTIVE: The Silver Tag - If the players understood the Lynx Shaman's warning, they have a secondary objective: infiltrate the main Animal Control office to steal a **specialized silver animal tag**. This is a high-risk detour that, if successful, gains the aspect **Silver Anti-Shapeshifter Tag**, a powerful tool for the final confrontation."
}
